{
    "EN":{
        "Cookie":{
            "description": "This website uses cookies. By browsing the site you consent to its use",
            "link": "Privacy Policy"
        },
        "About": {
            "title": "About Me",
            "text": "As a software developer with 5 years' experience, I like to turn innovative ideas into practical solutions. My journey into the world of technology has been marked by a curiosity and passion for programming.\n My knowledge spans several programming languages, including JavaScript, C#, C and Java.These languages are not just tools in my hands, they are the means by which I bring ideas to life and solve complex problems. I enjoy the challenge of creating efficient code needed for real-world applications.\n Being a tech enthusiast, I'm always on the lookout for the latest trends and advances in the industry. \nI'm currently studying Software Engineering at the Polytechnic Institute of Setúbal."
        },
        "Experience":{
            "title": "Experience",
            "data": [
                {
                    "year": "2023",
                    "experiences": [
                        {
                            "company": "RightCo",
                            "role": "Software Development Intern",
                            "description": "Contribution to the development of a geographically localized data system, using React.js for the frontend and Node.js for the backend; Implementation of automated tests using the Puppeteer library, which led to simplification of the quality control process, resulting in a 30% reduction in reported bugs and a 20% increase in development speed; Code optimization, resulting in improved user experience with a 15% reduction in response times and a 25% reduction in resource consumption"
                        }
                    ]
                },
                {
                    "year": "2021",
                    "experiences": [
                        {
                            "company": "Wyntegrate",
                            "role": "Software Development Intern",
                            "description": "Development of an employee document management application in Flutter web, resulting in a good user experience thanks to the minimalist design and code; API development and testing using Postman"
                        },
                        {
                            "company": "Wyntegrate",
                            "role": "Software Developer",
                            "description": "Development of an application for reading QR Codes in Flutter, having the application been fully developed and with a good user experience by processing data as efficiently as possible and minimalist design"
                        }
                    ]
                },
                {
                    "year": "2020",
                    "experiences": [
                        {
                            "company": "Secretaria-Geral do Ambiente",
                            "role": "IT Intern",
                            "description": "Helpdesk; Development of a web scrapper using VBA; PC configuration; Phone configuration; Software Installation"
                        }
                    ]
                }
            ]
        },
        "Projects":{
            "title": "Projects",
            "viewMore": "View More"
        },
        "Contact":{
            "title": "Contacts"
        }
    },
    "PT":{
        "Cookie":{
            "description": "Este site utiliza cookies. Ao navegar no site, consente com a sua utilização",
            "link": "Política de Privacidade"
        },
        "About": {
            "title": "Sobre Mim",
            "text": "Como programador com 5 anos de prática, gosto de transformar ideias inovadoras em soluções práticas. A minha jornada no mundo da tecnologia tem sido marcada por uma curiosidade e paixão pela programação.\n O meu conhecimento abrange várias linguagens de programação, incluindo JavaScript, C#, C e Java. Estas linguagens não são apenas ferramentas nas minhas mãos, são o meio pelo qual dou vida a ideias e resolvo problemas complexos. Gosto do desafio de criar código eficiente necessário para aplicações do mundo real.\n Sendo um entusiasta da tecnologia, estou sempre à procura das últimas tendências e avanços na indústria. \nAtualmente estou a estudar Engenharia de Software no Instituto Politécnico de Setúbal."
        },
        "Experience":{
            "title": "Experiência Profissional",
            "data":[
                {
                    "year": "2023",
                    "experiences": [
                        {
                            "company": "RightCo",
                            "role": "Estágio em Desenvolvimento de Software",
                            "description": "Contribuição para o desenvolvimento de um sistema de dados geograficamente localizados, utilizando React.js para o frontend e Node.js para o backend; Implementação de testes automatizados utilizando a biblioteca Puppeteer, que levou à simplificação do processo de controlo de qualidade, resultando numa redução de 30% nos bugs reportados e um aumento de 20% na velocidade de desenvolvimento; Otimização de código, resultando numa melhor experiência do utilizador com uma redução de 15% nos tempos de resposta e uma redução de 25% no consumo de recursos"
                        }
                    ]
                },
                {
                    "year": "2021",
                    "experiences": [
                        {
                            "company": "Wyntegrate",
                            "role": "Estágio em Desenvolvimento de Software",
                            "description": "Desenvolvimento de uma aplicação de gestão de documentos de funcionários em Flutter web, resultando numa boa experiência do utilizador graças ao design e código minimalista; Desenvolvimento de API e teste utilizando Postman"
                        },
                        {
                            "company": "Wyntegrate",
                            "role": "Desenvolvedor de Software",
                            "description": "Desenvolvimento de uma aplicação para leitura de QR Codes em Flutter, tendo a aplicação sido totalmente desenvolvida e com uma boa experiência do utilizador ao processar dados da forma mais eficiente possível e design minimalista"
                        }
                    ]
                },
                {
                    "year": "2020",
                    "experiences": [
                        {
                            "company": "Secretaria-Geral do Ambiente",
                            "role": "Estágio em TI",
                            "description": "Helpdesk; Desenvolvimento de um web scrapper utilizando VBA; Configuração de PC; Configuração de telefone; Instalação de software"
                        }
                    ]
                }
            ]
        },
        "Projects":{
            "title": "Projetos",
            "viewMore": "Ver Mais"
        },
        "Contact":{
            "title": "Contactos"
        }
    }
}